jobs/20260810-142819-luqia-vllm-nixl-3p3d-dvfs-c16-warmup-r2/results/252880/vllm_bench.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fbafcd2c5e0>, seed=0, num_prompts=36, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30640', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260810-142819-luqia-vllm-nixl-3p3d-dvfs-c16-warmup-r2/results/252880', result_filename='vllm_bench_detailed.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-81919720-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 08-10 14:43:42 [datasets.py:612] Sampling input_len from [511, 511] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 36/36 [09:12<00:00, 15.34s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     36        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  552.10    
Total input tokens:                      18396     
Total generated tokens:                  4608      
Request throughput (req/s):              0.07      
Output token throughput (tok/s):         8.35      
Peak output token throughput (tok/s):    60.00     
Peak concurrent requests:                18.00     
Total token throughput (tok/s):          41.67     
---------------Time to First Token----------------
Mean TTFT (ms):                          187821.33 
Median TTFT (ms):                        228466.36 
P99 TTFT (ms):                           326080.97 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          49.62     
Median TPOT (ms):                        59.64     
P99 TPOT (ms):                           59.73     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.65     
Median ITL (ms):                         59.41     
P99 ITL (ms):                            60.46     
==================================================